#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 1s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=jBd26Y2vNogWyQdabQ]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=z4KCCRTGPGs6v7WvqQ]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=tBJHXws4Wl7E0YX15w]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"]: Refreshing state... [id=gwPbgt8lbnZ1y4T7Ww]
module.vpn_routing.apstra_datacenter_connectivity_template_interface.vpn: Refreshing state... [id=210722b4-8845-11f0-a0e9-617073747261]
null_resource.force_redeploy: Refreshing state... [id=8767747182770807466]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # apstra_blueprint_deployment.dc_1 will be created
  + resource "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "fcdc36c5-ff24-4e16-bbd1-bee3822a0062"
      + comment                 = "$COMMENT Terraform {{.TerraformVersion}}, provider {{.ProviderVersion}}"
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "8767747182770807466" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "27" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "fcdc36c5-ff24-4e16-bbd1-bee3822a0062"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template_interface.vpn will be updated in-place
  ~ resource "apstra_datacenter_connectivity_template_interface" "vpn" {
      ~ description  = "includes routing policies for [Vendor_A, Vendor_B, Vendor_C, Vendor_D]" -> "includes routing policies for [Vendor_A, Vendor_B, Vendor_C]"
        id           = "210722b4-8845-11f0-a0e9-617073747261"
      ~ ip_links     = {
          ~ "IP handoff to VPN router" = {
              ~ bgp_peering_ip_endpoints = {
                  ~ "BGP peering with VPN router" = {
                        id               = "210722d2-8845-11f0-a0eb-617073747261"
                      ~ routing_policies = {
                          - "Vendor_D" = {
                              - id                = "e53fcf90-8846-11f0-9733-617073747261" -> null
                              - pipeline_id       = "e53fcfa2-8846-11f0-9733-617073747261" -> null
                              - routing_policy_id = "gwPbgt8lbnZ1y4T7Ww" -> null
                            },
                            # (3 unchanged elements hidden)
                        }
                        # (4 unchanged attributes hidden)
                    },
                }
                id                       = "210722c8-8845-11f0-a0e9-617073747261"
                # (5 unchanged attributes hidden)
            },
        }
        name         = "IP+BGP handoff to VPN block"
        tags         = [
            "terraform",
            "test",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"] will be destroyed
  # (because key ["Vendor_D"] is not in for_each map)
  - resource "apstra_datacenter_routing_policy" "vpn" {
      - blueprint_id        = "fcdc36c5-ff24-4e16-bbd1-bee3822a0062" -> null
      - description         = "Vendor_D: Import count: 1 Export count: 3" -> null
      - expect_default_ipv4 = true -> null
      - expect_default_ipv6 = true -> null
      - export_policy       = {
          - export_l2_edge_subnets        = false -> null
          - export_l3_edge_server_links   = false -> null
          - export_loopbacks              = false -> null
          - export_spine_leaf_links       = false -> null
          - export_spine_superspine_links = false -> null
          - export_static_routes          = false -> null
        } -> null
      - extra_exports       = [
          - {
              - action = "permit" -> null
              - prefix = "10.5.0.0/24" -> null
            },
          - {
              - action = "permit" -> null
              - prefix = "10.5.7.0/24" -> null
            },
          - {
              - action = "permit" -> null
              - prefix = "10.5.64.0/22" -> null
            },
        ] -> null
      - extra_imports       = [
          - {
              - action = "permit" -> null
              - prefix = "172.19.0.0/24" -> null
            },
        ] -> null
      - id                  = "gwPbgt8lbnZ1y4T7Ww" -> null
      - import_policy       = "extra_only" -> null
      - name                = "Vendor_D" -> null
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   